[{"title":"Animal Connect Master","appId":"com.xgame247.animalconnect","url":"https://play.google.com/store/apps/details?id=com.xgame247.animalconnect","icon":"https://play-lh.googleusercontent.com/9abGc7wDH_tkeR8gH0bSPS7OYD1jY2N7Zc-hsm1N-dt4EINjCfontMKjN4VFeaeMrE7F","developer":"Innova Dev4VN","currency":"USD","price":0,"free":true,"summary":"A captivating mobile game that brings together adorable animals and the challenge of connecting them. Embark on a delightful journey through various levels as you explore vibrant game boards filled with cute animal tiles. Your goal is to match and connect identical animal pairs with a line, but be careful, the line cannot make more than two turns.","scoreText":"0.0","score":0},{"title":"Star Wing Flight","appId":"com.dev4vn.games.starwingflight","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.starwingflight","icon":"https://play-lh.googleusercontent.com/ZDliPgP66X9WnVHcB7nikemE7um_tGE9SwfIasNX2iid6kFdl-KzqNB1yJGevTof_oI","developer":"Innova Dev4VN","currency":"USD","price":0,"free":true,"summary":"Star Wing Flight is an arcade space plane shooter that offers a thrilling experience of dramatic air battles.<br>Join the Star Wing Flight today and become an excellent pilot to protect the earth from the wave of aliens invading the earth. Take control of the spaceship and shoot down the alien formations and stop the enemy from destroying the earth!<br><br>Features of Star Wing Flight:<br>- Top notch graphics and cool animations<br>- Thousands of thrilling missions<br>- Dozens of starships: Attack with different guns, lasers and missiles<br>- Classic arcade shooter reminiscent of board games<br>- Modern controls give you a fun and addictive gameplay","scoreText":"0.0","score":0},{"title":"Build House","appId":"com.happydevvn.buildhouse","url":"https://play.google.com/store/apps/details?id=com.happydevvn.buildhouse","icon":"https://play-lh.googleusercontent.com/L_moPJDPRt-TN7fO3ETC7SMmefr2jfKf3t3yZg96mbu21aDMXUFouT-QCcjo9oR4y8w","developer":"Innova Dev4VN","currency":"USD","price":0,"free":true,"summary":"The white houses are so dull. Let&#39;s add some color to them in just a few seconds!<br><br>To complete each level, you need to paint all the blank spaces. Swipe left, right, up, and down to fill in all the gaps!<br><br>Every level can be 100% solved, but not everyone can do it! Are you ready for the challenge?","scoreText":"0.0","score":0},{"title":"Bear Hunter","appId":"com.xgame247.bearhunter","url":"https://play.google.com/store/apps/details?id=com.xgame247.bearhunter","icon":"https://play-lh.googleusercontent.com/dHie8KGzSkBoLPMKdDP3C7vtTgaePwagljlUlvhQpHX-07kabhWhqHGwGJ6Baw5eios","developer":"Innova Dev4VN","currency":"USD","price":0,"free":true,"summary":"Embark on the ultimate bear hunting adventure with Bear Hunter! Immerse yourself in the thrill of the wild as you step into the shoes of a skilled hunter, ready to take on the challenge of tracking and hunting down majestic bears in their natural habitat.<br><br>🌲 Explore the Wilderness: Traverse through breathtaking environments teeming with life. From dense forests to snow-covered peaks, each area offers a unique hunting experience that tests your skills and patience.<br><br>🎯 Precision Shooting: Hone your marksmanship with realistic hunting mechanics. Take aim, factor in wind direction, and choose the perfect moment to strike. Your accuracy will determine your success on the hunt.<br><br>🛠️ Gear Up: Customize your hunting gear to suit different terrains and challenges. Unlock a wide range of rifles, scopes, camouflage, and accessories to enhance your hunting prowess.<br><br>🏞️ Dynamic Weather: Adapt to changing weather conditions that affect animal behavior. Rain, fog, and snow provide an immersive experience that adds an extra layer of challenge to your hunts.<br><br>🔍 Tracking Skills: Use your keen observation skills to track bear footprints, claw marks, and other signs. Study their behavior to anticipate their movements and plan your strategy.<br><br>Step into the wild and become a master bear hunter in this exhilarating simulation game. Download Bear Hunter now to experience the rush of the hunt, the beauty of nature, and the satisfaction of a well-earned victory. Unleash your inner hunter and conquer the wilderness today!","scoreText":"0.0","score":0},{"title":"Ball Run 2D","appId":"com.opengame.balldodge","url":"https://play.google.com/store/apps/details?id=com.opengame.balldodge","icon":"https://play-lh.googleusercontent.com/YJby525aClinoZHFn0oXo7qQ3k-SzbuKNk6-laO8KIDXw5ZvysTZ3PnFqI65mWE1qA","developer":"Innova Dev4VN","currency":"USD","price":0,"free":true,"summary":"Dive into Ball Dodge, the ultimate reflex challenge game! Guide the bouncing ball, dodge mines &amp; obstacles, compete for high scores globally. Addictive gameplay, dynamic obstacles, power-ups, stunning visuals, engaging soundtrack. Download now for non-stop fun!","scoreText":"0.0","score":0},{"title":"Basketball 3D","appId":"com.king.games.basketball3d","url":"https://play.google.com/store/apps/details?id=com.king.games.basketball3d","icon":"https://play-lh.googleusercontent.com/nHH5lT3daibmIn6oa4nRBXXH3RrAERC9-pXblgg5-3I2qfTanobmCWpPN05nlc_svkU4","developer":"Innova Dev4VN","currency":"USD","price":0,"free":true,"summary":"Basketball 3D: Simple &amp; Fun is the ultimate basketball experience on your mobile device! Get ready to test your shooting skills as you take control of the hoop and aim to score perfect shots. This addictive game offers a delightful mix of challenge and relaxation that will keep you coming back for more!<br><br>**Key Features:<br>- Easy Controls: Swipe left or right to move the hoop and catch the falling basketballs. It&#39;s intuitive and perfect for players of all ages.<br><br>- Challenging Gameplay: With each level, the difficulty increases, providing a thrilling challenge for seasoned players while remaining accessible to newcomers.<br><br>- Score Streaks: Keep your shooting streak alive to earn bonus points and climb the leaderboards. Can you become the top scorer?<br><br>- Variety of Hoops: Unlock and choose from a range of hoop designs, each with unique attributes. Find your favorite and showcase your style!<br><br>- Power-Ups: Discover special power-ups that boost your shooting ability and help you score even more points. Strategically use them to maximize your performance.<br><br>- Stunning 3D Graphics: Immerse yourself in a realistic basketball environment with vibrant visuals and smooth animations.<br><br>- Play Anytime, Anywhere: Enjoy the game on the go, during short breaks, or whenever you need a fun and relaxing experience.<br><br>- Achievements and Rewards: Complete challenges and earn exciting rewards to enhance your gameplay and progress faster.<br><br>- No Internet Required: Play offline, so you&#39;re never limited by a poor internet connection.<br><br>Basketball 3D: Simple &amp; Fun is suitable for players of all ages and skill levels. Whether you&#39;re a casual gamer looking for some entertainment or a basketball enthusiast seeking a quick hoops fix, this game has got you covered. Sharpen your shooting accuracy, master the art of precision, and become a basketball legend!","scoreText":"0.0","score":0},{"title":"Basket Strike","appId":"com.king.games.basketballhit","url":"https://play.google.com/store/apps/details?id=com.king.games.basketballhit","icon":"https://play-lh.googleusercontent.com/GpnSaubXDGZQ7nTsTegiqLkamEEMF8XTINFeB3jVOELrGHxV7lpMHdAgWZe9-rhabkE","developer":"Innova Dev4VN","currency":"USD","price":0,"free":true,"summary":"Welcome to Basket Strike, the ultimate ball-cutting game that guarantees hours of addictive fun!<br><br>In this thrilling puzzle game, your goal is to skillfully cut the ropes at the right moment, releasing the basketball to score epic hoops. With intuitive controls, immerse yourself in the challenge of guiding the ball through various obstacles to reach the basket.<br><br>#Key Features:<br>- Addictive Gameplay: Experience the thrill of slicing ropes and making perfect shots, providing endless excitement for players of all ages.<br><br>- Precision and Timing: Test your precision and timing skills as you strategize and plan the best moment to cut the ropes, avoiding any hindrances on your way to victory.<br><br>- Varied Levels: Explore a wide range of levels, each presenting unique challenges and creative puzzles that keep you engaged and entertained.<br><br>- Stunning Graphics: Enjoy eye-catching visuals and vibrant animations that enhance the overall gaming experience.<br><br>- Relaxing Ambiance: Unwind with the game&#39;s soothing background music and delightful sound effects, creating a calming atmosphere while you play.<br><br>- Unlock Achievements: Complete challenging objectives and unlock exciting achievements, adding a sense of accomplishment to your gameplay.<br><br>- Compete with Friends: Connect with friends and compete for the highest scores, fostering friendly rivalry and encouraging social interaction.<br><br>- Free to Play: Basket Strike offers a thrilling gaming experience without any cost, ensuring accessibility to all players.<br><br>- Offline Mode: Play anytime, anywhere, as Basket Strike supports offline play, allowing you to enjoy the game even without an internet connection.<br><br>Dive into the world of precision basketball shots and unravel the exciting challenges of Basket Strike. Sharpen your cutting skills, time your shots to perfection, and witness the ball gracefully land into the basket. It&#39;s an addictive, fun, and relaxing experience that will keep you coming back for more!<br><br>Download Basket Strike now and immerse yourself in a delightful puzzle adventure that&#39;s sure to captivate both casual gamers and basketball enthusiasts alike. Score those hoops and become a master of the slice!","scoreText":"0.0","score":0},{"title":"Air Balloon Skies","appId":"com.xgame247.airballoonadventure","url":"https://play.google.com/store/apps/details?id=com.xgame247.airballoonadventure","icon":"https://play-lh.googleusercontent.com/GcWe4vWCCHJ6dvjXIeVpzBnI6-ZDEg-IUMb8sVVb9O17nucI7ndW5RrE1zujDAEorNI","developer":"Innova Dev4VN","currency":"USD","price":0,"free":true,"summary":"&quot;Air Balloon Skies&quot; is an exciting and entertaining game that promises endless fun for players of all ages.<br><br>Embark on a thrilling adventure as you take control of a balloon, navigating it through treacherous paths filled with deadly spiked obstacles. Test your skills and wit as you guide the balloon to safety, avoiding all obstacles in your path.<br><br>Key Features:<br>- Intuitive Controls: Experience smooth and responsive controls that allow you to maneuver the balloon with precision and ease.<br><br>- Challenging Levels: Conquer a variety of increasingly difficult levels, each with unique layouts and obstacles to keep you engaged and entertained.<br><br>- Brain-Teasing Puzzles: Encounter brain-teasing puzzles that will challenge your problem-solving abilities and strategic thinking.<br><br>- Stunning Visuals: Immerse yourself in the vibrant and colorful world of &quot;Air Balloon Skies,&quot; with captivating graphics that enhance the overall gaming experience.<br><br>- Relaxing Gameplay: Find solace in the game&#39;s calming atmosphere and soothing soundtrack, making it the perfect choice for unwinding after a long day.<br><br>- Achievements and Rewards: Unlock achievements and collect rewards as you progress through the game, adding an extra layer of excitement and motivation.<br><br>- Compete with Friends: Connect with your friends and compete for the highest scores, fueling friendly competition and creating lasting memories.<br><br>- Adrenaline Rush: Experience an adrenaline rush as you skillfully navigate the balloon through narrow gaps, and feel the satisfaction of conquering challenging levels.<br><br>- Free to Play: &quot;Air Balloon Skies&quot; offers an immersive gaming experience without any cost, ensuring accessibility for everyone.<br><br>- Offline Play: Play anytime, anywhere, as &quot;Air Balloon Skies&quot; supports offline play, eliminating the need for a constant internet connection.<br><br>Step into the captivating world of &quot;Air Balloon Skies&quot; and embrace the thrill of guiding your balloon through perilous paths. With its addictive gameplay and captivating visuals, this game guarantees endless hours of relaxation and enjoyment. Whether you are seeking a quick break or a longer gaming session, &quot;Air Balloon Skies&quot; is the ultimate choice for a delightful and immersive experience.<br><br>Download &quot;Air Balloon Skies&quot; now and embark on an enchanting adventure filled with challenges, laughter, and entertainment. Get ready to rise above the skies, avoid the spikes, and become a master of the balloon!","scoreText":"0.0","score":0},{"title":"Sky Bounce Ball","appId":"com.dev4vn.skyballjump","url":"https://play.google.com/store/apps/details?id=com.dev4vn.skyballjump","icon":"https://play-lh.googleusercontent.com/53lUAYgXnKue0N_2Y2TCRiKabeGybCW1-zhQyMxObSC0I-WO6p1Z6nZNzhM2p3q2rpAC","developer":"Innova Dev4VN","currency":"USD","price":0,"free":true,"summary":"Sky Bounce Ball - Addictive Arcade Bouncing Adventure!<br><br>Join the thrilling bouncing adventure with Sky Bounce Ball! Test your reflexes and precision in this exciting arcade game, available now on Google Play.<br><br>Key Features:<br><br>1. Bounce to the Sky: Control the ball&#39;s direction with intuitive swipe controls. Bounce on rotating discs to climb higher and higher. Reach for the skies!<br><br>2. Endless Challenges: Experience non-stop excitement with endless levels. Can you set a new high score? Challenge yourself and your friends!<br><br>3. Collect Stars: Gather shining stars as you bounce your way up. Unlock new balls with unique abilities for more exciting gameplay.<br><br>4. Power-Ups: Discover power-ups during your journey that boost your performance and help you overcome tricky obstacles.<br><br>5. Stunning Visuals: Immerse yourself in eye-catching graphics and vibrant colors. The game&#39;s visuals complement the addictive gameplay.<br><br>6. Easy to Learn, Difficult to Master: Sky Bounce Ball offers simple controls that anyone can pick up. However, mastering the game and reaching top heights will require skill and precision.<br><br>7. Compete Globally: Compare your scores with players worldwide and become the top bouncer on the global leaderboard.<br><br>8. Play Offline: No internet connection? No worries! Enjoy Sky Bounce Ball anytime, anywhere, even without an internet connection.<br><br>9. Free to Play: Sky Bounce Ball is free to download and play. Experience endless fun without spending a dime!<br><br>10. Regular Updates: We&#39;re committed to enhancing your gaming experience. Look forward to regular updates with new levels, balls, and exciting features.<br><br>How to Play:<br><br>Swipe left or right to control the ball&#39;s direction. Bounce on discs to ascend higher, collecting stars along the way. Use power-ups wisely for an extra boost. Stay focused and go as high as you can!<br><br>Why Play Sky Bounce Ball?<br><br>Sky Bounce Ball is the ultimate arcade bouncing experience that delivers hours of entertainment. Challenge your reflexes, test your precision, and set new records as you ascend to the skies. With its easy-to-learn controls and captivating gameplay, it&#39;s suitable for players of all ages.<br><br>Whether you have a few minutes to spare or want to immerse yourself in an addictive adventure, Sky Bounce Ball is the perfect game for you. Download now and start your journey to the top!","scoreText":"0.0","score":0},{"title":"Sugar Rush Saga","appId":"com.saga.sugarrushcandy","url":"https://play.google.com/store/apps/details?id=com.saga.sugarrushcandy","icon":"https://play-lh.googleusercontent.com/FTKxiiZLsbExCkAwm7HK9WWe7n8vsbNLRqvGnbP2a9F8r0LDgtmxn1NaUbiiLkhzY0A","developer":"Innova Dev4VN","currency":"USD","price":0,"free":true,"summary":"**Sugar Rush Saga: The Sweetest Puzzle Adventure!**<br><br>Embark on a delightful journey filled with sugary delights in Sugar Rush Saga! Immerse yourself in a candy-coated world, where delicious challenges await you. Match colorful candies and solve challenging puzzles in this addictively fun and sweet-filled game. With its captivating gameplay and delightful graphics, Sugar Rush Saga is sure to satisfy your sweet tooth and keep you entertained for hours on end!<br><br>**Key Features:**<br><br>1. Sweet &amp; Addictive Gameplay: Indulge in a sugar-coated adventure with match-3 puzzle mechanics that will keep you hooked! Swipe and match candies of the same color to create mouthwatering combos and clear the board.<br><br>2. Tasty Levels &amp; Exciting Challenges: Explore a variety of delicious levels, each with its unique set of challenges. From clearing the jelly to collecting gummy bears, every level offers a delightful twist that keeps the gameplay fresh and engaging.<br><br>3. Special Candy Boosters: Unleash the power of special candy boosters to overcome tricky obstacles and complete levels with ease. Create striped candies, color bombs, and more to create dazzling effects and boost your scores.<br><br>4. Sugar Rush Events &amp; Rewards: Join in on special Sugar Rush events and competitions to earn amazing rewards and boosters. Compete with friends and players worldwide on the leaderboards to prove yourself as the ultimate candy master.<br><br>5. Sweet Graphics &amp; Enchanting Sound: Immerse yourself in a visually stunning world of colorful candies and vibrant animations. The delightful soundtrack will keep you grooving as you progress through the sugary adventure.<br><br>6. Daily Treats &amp; Gifts: Come back daily to claim your sweet rewards! From daily spin wheels to surprise gifts, there&#39;s always something special waiting for you.<br><br>7. Play Offline: Don&#39;t let a lack of internet connection stop your sugar cravings! Sugar Rush Saga offers an offline mode, allowing you to enjoy the sweet fun anywhere, anytime.<br><br>8. Social Integration: Connect with your friends through Facebook and see who&#39;s topping the leaderboards. Share your progress, send and receive lives, and celebrate your sweet victories together!<br><br>**How to Play:**<br><br>- Swap and match at least three candies of the same color to create explosive combinations and clear the board.<br>- Utilize special candy boosters strategically to overcome challenging levels.<br>- Complete levels and earn stars to progress through the sugary world.<br>- Participate in special events and compete with friends for exciting rewards and bragging rights.<br>- Keep coming back for daily treats and gifts to fuel your sweet adventure.<br><br>**Join the Sweetest Puzzle Adventure Today!**<br><br>Sugar Rush Saga is the perfect blend of challenging puzzles, sweet rewards, and delightful visuals. Dive into a world of sugary wonders and embark on a candy-matching escapade like no other. Download Sugar Rush Saga now and satisfy your sweet cravings with this exciting and addictively fun match-3 puzzle game!","scoreText":"0.0","score":0},{"title":"Puzzle Monarch","appId":"com.king.games.blockpuzzle","url":"https://play.google.com/store/apps/details?id=com.king.games.blockpuzzle","icon":"https://play-lh.googleusercontent.com/kxXhNWbNlF1kOFFn_nVO8HPztPBwnDixO_Rn8_TKSN73_B66XRfffn2qyYB3DlzSOg","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Clear lines, place blocks strategically. Addictive puzzle fun!","scoreText":"0.0","score":0},{"title":"Puzzle Art Master","appId":"com.king.games.puzzleartmaster","url":"https://play.google.com/store/apps/details?id=com.king.games.puzzleartmaster","icon":"https://play-lh.googleusercontent.com/9biQ-dn-ToLe3NqwKaWgPRETUNy9Q6VwwHHV8cl5vIskCmhqeOGIRlWEwJZ2VCkBWGo","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Explore creativity with Puzzle Art Master - A fusion of puzzles and art.","scoreText":"0.0","score":0},{"title":"House Paint Color","appId":"com.xgame247.housepaintcolor","url":"https://play.google.com/store/apps/details?id=com.xgame247.housepaintcolor","icon":"https://play-lh.googleusercontent.com/6JR-mXmAwRxh9w-NmyQwz4Xb1mp2KJBkZl68oHnZvjGGXSsN4uKbv4Z0CHu8pFjUFuY","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Show your creative talent in painting the entire exterior wall of the house","scoreText":"0.0","score":0},{"title":"Ball Frenzy 3D","appId":"com.dev4vn.games.angryball3d","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.angryball3d","icon":"https://play-lh.googleusercontent.com/HB-_2VRRHEsmuyTMoK7JSJl1XWzEoVw0LWeEzMca3mTkdazTrrxbXQY4Nh32e2mDhg","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"This single-tap hyper casual game will keep you hooked as you release balls","scoreText":"0.0","score":0},{"title":"Army Driver","appId":"com.xgame247.armydriver","url":"https://play.google.com/store/apps/details?id=com.xgame247.armydriver","icon":"https://play-lh.googleusercontent.com/-0DjEe3_NgVvnMfvD96hExckyHV_onAfg-FpCLgKRwsXiCdz-OsHJQCqk2-dK7tzwg","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"A fun driving game where you race through 30 levels","scoreText":"0.0","score":0},{"title":"Airplane Drawmaster","appId":"com.dev4vn.airplanedrawmaster","url":"https://play.google.com/store/apps/details?id=com.dev4vn.airplanedrawmaster","icon":"https://play-lh.googleusercontent.com/j-SBdtIphi8NNFdCe5xMCI1cTaHvKLCkpfSdkge0XxNz_UY-ABIIfUDGsj2Z_PvhbAc","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"The ultimate drawing challenge for flight enthusiasts","scoreText":"0.0","score":0},{"title":"Mini Games Box","appId":"com.dev4vn.xgame247","url":"https://play.google.com/store/apps/details?id=com.dev4vn.xgame247","icon":"https://play-lh.googleusercontent.com/lgYkwmm_Bgzhz9DGgrFAchNR0l4N4qJ04hrFgq1ziXiRd3bgzrXHbMX4pssxoDCPwA","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Play Casual Games your ultimate destination for endless fun and excitement!","scoreText":"0.0","score":0},{"title":"Ball Roll 3D","appId":"com.dev4vn.xgame247.ballrunner3d","url":"https://play.google.com/store/apps/details?id=com.dev4vn.xgame247.ballrunner3d","icon":"https://play-lh.googleusercontent.com/LuDcdlW_0d-nZn0L7ST4MyOiyWiPX5_zU9I5GKzm7m-AdC8285GPqjco-jgAwAx9Ieg","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Prepare for an exhilarating adventure in Ball Runner 3D","scoreText":"0.0","score":0},{"title":"Chicken Fusion","appId":"com.dev4vn.games.chickenmerge","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.chickenmerge","icon":"https://play-lh.googleusercontent.com/4feZLHqFFjEhWYXrlNOwZc96x4BNsUZWDkH87A3swi6RupClqfzZS_cwd-Eqce5d2u4","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Combine adorable chickens to create new and unique breeds","scoreText":"0.0","score":0},{"title":"Egg Blaster","appId":"com.dev4vn.games.eggblaster","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.eggblaster","icon":"https://play-lh.googleusercontent.com/PBRkjWWnQ3iNtrfEfX4uQzg1qxAsxiGoV9ay-GYU4XPTFzbUcH1EnCLETwpxxdQuIg","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Get cracking in the egg-citing world of Egg Shooter","scoreText":"0.0","score":0},{"title":"Sniper Shooter","appId":"com.dev4vn.xgame247.snipershooter","url":"https://play.google.com/store/apps/details?id=com.dev4vn.xgame247.snipershooter","icon":"https://play-lh.googleusercontent.com/yYKR6Z9LWHfQYZDbQ4hSFyTpgpUJxlBHXw4SVZQBGvA3FJfJpdh_C72eW0_fnbxbLTY","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Destroy all the pirate pirates in the Sniper Shooter shooting game!","scoreText":"0.0","score":0},{"title":"Tube bird","appId":"com.dev4vn.xgame247.tubebird","url":"https://play.google.com/store/apps/details?id=com.dev4vn.xgame247.tubebird","icon":"https://play-lh.googleusercontent.com/e547rAVvXHfXtlL54AAEgons_tyTqn6_CqhKypFXd4kNKUe_rvRKXL0h-tNKfzKiBWY","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Control a pixelated bird and navigate it through a series of pipes","scoreText":"0.0","score":0},{"title":"Colorful Ball Sort","appId":"com.xgame247.ballsortpuzzle","url":"https://play.google.com/store/apps/details?id=com.xgame247.ballsortpuzzle","icon":"https://play-lh.googleusercontent.com/dhqnfGyJ2n1LishN9HTIULXQEj7sFRYmlzR8d7ghrfsGuitSG8bmtERl2hjS09uNCYU","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Tests your problem-solving skills and color-matching abilities","scoreText":"0.0","score":0},{"title":"Blade Master","appId":"com.dev4vn.games.blademaster","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.blademaster","icon":"https://play-lh.googleusercontent.com/9py2Frmo9lFSVnvxQHyOqa5qcYqVLRK6a5KG6ndw0YXfZgOVFkuIiz_hzI6j7SrxupY","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Players will play the role of a strong and talented character","scoreText":"0.0","score":0},{"title":"Cat and dog","appId":"com.xgame247.catanddog","url":"https://play.google.com/store/apps/details?id=com.xgame247.catanddog","icon":"https://play-lh.googleusercontent.com/mjJF-xBB5jiTfiKfFl2Q0oXL8SRMK3CANmYSJ5D2zD7uErrKfyYWbO4sxep_eLQXxg","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Pits two iconic domestic animals against each other","scoreText":"0.0","score":0},{"title":"Flight Force","appId":"com.dev4vn.games.planefightforce","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.planefightforce","icon":"https://play-lh.googleusercontent.com/g-vU6GocC25rLV9ZVmpSIjfJ5L4mCGfovZVMNhVPlKJ9NhZIHAhpq1aLlKKbawDnimg","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Cockpit of powerful fighter jets","scoreText":"0.0","score":0},{"title":"Doge Saver","appId":"com.xgame247.rescuedoge","url":"https://play.google.com/store/apps/details?id=com.xgame247.rescuedoge","icon":"https://play-lh.googleusercontent.com/NFXuaiOdb84G0H6w68hbHrUuByXeInzl8rahmm0AMtg28nlZTWWjZyHdBnnJpzODcyhu","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Oh my God! These bees are truly formidable! Can you protect Doge from the bees?","scoreText":"0.0","score":0},{"title":"Cube Bird Journey","appId":"com.dev4vn.xgame247.cubebird","url":"https://play.google.com/store/apps/details?id=com.dev4vn.xgame247.cubebird","icon":"https://play-lh.googleusercontent.com/x62h7zRxJXKeST0vzacyK4Uo01RZqubRJ0pfXg10hHEfVaTZlSXD17J6XecTs-MUBwg","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"The thrill of flying and the challenge of precision","scoreText":"0.0","score":0},{"title":"Magic juice shop","appId":"com.dev4vn.games.magicjuiceshop","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.magicjuiceshop","icon":"https://play-lh.googleusercontent.com/xDHhm1ci-m6DKjrQMH2HR9bZsuDvwYZ90Bek0oT0R7QUl3m61Z43pjaMPQaJh9B1ays","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Step into the role of a skilled juice maker, run your own fantastical juice shop","scoreText":"0.0","score":0},{"title":"Solitaire Quest","appId":"com.xgame247.solitailequest","url":"https://play.google.com/store/apps/details?id=com.xgame247.solitailequest","icon":"https://play-lh.googleusercontent.com/Sy_Y7cFn9UXDMkGmhil_7tHe2kHb5dMfTx6A050OWKRc36VXTOt-uCTEdc7q3mhzts2U","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Take a break and exercise your brain with our classic Solitaire game!","scoreText":"0.0","score":0},{"title":"Animal Onet Matching","appId":"com.xgame247.onetconnectanimalpikachu","url":"https://play.google.com/store/apps/details?id=com.xgame247.onetconnectanimalpikachu","icon":"https://play-lh.googleusercontent.com/C-GT2FEk7ZFajEipKJQMdKb0C8GocawcSxw__TGlJjXwbDWtBFYDD7hhjrHzR0E_M-8","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Adorable animal characters and the lovable puzzle game","scoreText":"0.0","score":0},{"title":"Neon Tetra Block","appId":"com.xgame247.neontetrablock","url":"https://play.google.com/store/apps/details?id=com.xgame247.neontetrablock","icon":"https://play-lh.googleusercontent.com/kvpv9fgQhAEwHdH5D42ee0YiuvHD0D_wVpUcGzOB1cdDNV3kDAqmelgPqW8T-N-IKgM","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"An exciting visually striking puzzle game","scoreText":"0.0","score":0},{"title":"Pipeline Puzzle","appId":"com.dev4vn.xgame247.pipelinepuzzle","url":"https://play.google.com/store/apps/details?id=com.dev4vn.xgame247.pipelinepuzzle","icon":"https://play-lh.googleusercontent.com/4-G1izW-JdoEq4-1lcYtRs4Htfuo6B44ZGEl75czSYHJ8EulkVOztOm0g_KyYaCGkw","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Put your problem-solving skills to the test","scoreText":"0.0","score":0},{"title":"Cawboy Sharpshooter","appId":"com.dev4vn.xgame247.cawboyshooter","url":"https://play.google.com/store/apps/details?id=com.dev4vn.xgame247.cawboyshooter","icon":"https://play-lh.googleusercontent.com/Q2nfkKAo-tO4LZO9LkYyghM3EWQ0JxUb3UOe2zEmBUoiVxz74goBjIidXGHUxh6yp-c","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"An action-packed game set in the wild west","scoreText":"0.0","score":0},{"title":"Turbo moto racing","appId":"com.xgame247.turbomotoracing","url":"https://play.google.com/store/apps/details?id=com.xgame247.turbomotoracing","icon":"https://play-lh.googleusercontent.com/lakoVfREfH8JdEC2tYjNQG36h-uvXb1OO-fXJ-FkKx2yt25fSA68v_U_Wrg2w6lckw9F","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"An exhilarating racing game","scoreText":"0.0","score":0},{"title":"Bottle Bounce","appId":"com.dev4vn.games.bottlebounce","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.bottlebounce","icon":"https://play-lh.googleusercontent.com/a3NBWLaVjgi31Rk7HeN_fYTc9DFXvekz5zdPwDk8eVBLrIoBggV9lwTSxtjeANsl-mo","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Discover the beloved challenge of Bottle Bounce now on your phone!","scoreText":"0.0","score":0},{"title":"Basketball Kings","appId":"com.dev4vn.games.basketballking","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.basketballking","icon":"https://play-lh.googleusercontent.com/GeSvzCvzOF0eHMNmRBWSFNDel7xpTDcMQcSS-OPTl2eYlNX1t6roQ7PYwg7dNFc5hxk7","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Brings the excitement of basketball to your fingertips","scoreText":"0.0","score":0},{"title":"8 Ball Pool Pro","appId":"com.dev4vn.games.poll8ballpro","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.poll8ballpro","icon":"https://play-lh.googleusercontent.com/uife3EJvPeZzS8gLUf2ZgMuaP_Lom_PNNvcqYMJ-u1IzMz6HUaFhw4CwcPgtwjlQKsI","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"An addictive and realistic billiards game","scoreText":"0.0","score":0},{"title":"Road Truck Simulator","appId":"com.dev4vn.xgame247.trucksimulator","url":"https://play.google.com/store/apps/details?id=com.dev4vn.xgame247.trucksimulator","icon":"https://play-lh.googleusercontent.com/G938dzug05I7JLiZoh_n4xGeJbslZG7EQu0DtdkpsqEl-ENwY4vsif3P9ELzHToyDEvz","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Truck Simulator is an immersive mobile game","scoreText":"0.0","score":0},{"title":"Soccer Superstar","appId":"com.xgame247.soccer","url":"https://play.google.com/store/apps/details?id=com.xgame247.soccer","icon":"https://play-lh.googleusercontent.com/97hD41qnAopFXpiBfRVXBkRKVwJvBtbkCET8VUNDTIhz4vVhS7f0U6JHBI-YQzbK5CM","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"A football game funny","scoreText":"0.0","score":0},{"title":"Tiến Lên MN","appId":"com.xgame247.tienlenkg","url":"https://play.google.com/store/apps/details?id=com.xgame247.tienlenkg","icon":"https://play-lh.googleusercontent.com/7ZA-6XsIVsvGpCx_PN6nausWge8uUxgk6VxM5MycjeAfsSeUMwtgbPXhTulLB47GJO8","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Tien Len is a popular and fun card game","scoreText":"0.0","score":0},{"title":"Brick Buster Challenge","appId":"com.dev4vn.games.brickbusterchallenge","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.brickbusterchallenge","icon":"https://play-lh.googleusercontent.com/6BrVBzaQgRhTpy8LbeYfE77KkJsWExmplGa8kdRkZjwDUAk9Ask94KJsTL4vlsTc5g","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Destroy bricks by controlling a marble and pushing it across the screen","scoreText":"0.0","score":0},{"title":"Paws Rescue","appId":"com.xgame247.savethedog","url":"https://play.google.com/store/apps/details?id=com.xgame247.savethedog","icon":"https://play-lh.googleusercontent.com/zZhh0G9249JEeNv2biEdZiZNnRoFB8I9fKXdoyrSFL5RzNKxmNIrwTvmyN-n7Dbi4Q","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Your task is to draw walls to protect Doge from the attack of bees in the hive.","scoreText":"0.0","score":0},{"title":"Color Cascade","appId":"com.dev4vn.games.watercolorsort","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.watercolorsort","icon":"https://play-lh.googleusercontent.com/8gmL3ZOyFHnVM7al-WtEvA1etSG46il4rSQ7hE6bOYvuCIcBQG2LOYsV6gu6SQKuOns","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"An engaging puzzle game where your task is to adeptly mix &amp; sort various colors","scoreText":"0.0","score":0},{"title":"Onet Puzzle","appId":"com.dev4vn.games.onetpuzzle","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.onetpuzzle","icon":"https://play-lh.googleusercontent.com/gOL9_9R7TWp9IMqqT-sJKb30_bVtRaQ887lwmbeHu2n_CEBmQD_kB6fVE7LaAsiW2ESz","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"The highly anticipated sequel to the beloved puzzle game","scoreText":"0.0","score":0},{"title":"Onet Garden","appId":"com.dev4vn.games.onetgarden","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.onetgarden","icon":"https://play-lh.googleusercontent.com/p5-H3D9TMYgJQ-AqaazqudaOYGVS9nO6Bj09P1uHqixXkx28kIwkzduMywIDqAttnGv9","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"A captivating puzzle game where your task is to connect identical icons","scoreText":"0.0","score":0},{"title":"Sweet World 3","appId":"com.dev4vn.games.sweetworld","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.sweetworld","icon":"https://play-lh.googleusercontent.com/FCOy1tHmOeIhiC6hZ_fSerkiLSNi3scwMzf_DvmYpVIHqmOxeW1twS_MJ7U5bfNtYSM","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"A matching game! An enchanting adventure set in a fantastical land of candy","scoreText":"0.0","score":0},{"title":"Block Stacker","appId":"com.xgame247.stacktris","url":"https://play.google.com/store/apps/details?id=com.xgame247.stacktris","icon":"https://play-lh.googleusercontent.com/3vaXY2OIC4TYWG58vhwseY_bsvNld6PE-vz_CgdqVhcL7Lw_No6VzmPxdICNEzoZmEg","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Arcade game revolves around stacking and balancing blocks known as tetrominoes","scoreText":"0.0","score":0},{"title":"Blumgi Slime","appId":"com.xgame247.blumgislime","url":"https://play.google.com/store/apps/details?id=com.xgame247.blumgislime","icon":"https://play-lh.googleusercontent.com/yEhf5A_s8Jz2RI4lg4P11oDs-Mz5gIi0KkaoO1Nv7wSgvBAneENZgWuA2aYZABLO8D4","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"An exciting arcade game designed to challenge your timing and aiming abilities","scoreText":"0.0","score":0},{"title":"Fruit Juice Delights","appId":"com.xgame247.fruitjuice","url":"https://play.google.com/store/apps/details?id=com.xgame247.fruitjuice","icon":"https://play-lh.googleusercontent.com/cNche_xx7ftzXu6g2p7aKFl7eNbC7kV7PIflIT6cWKM49Z7N4pV3t1NEg8YqbWD3ft4","developer":"Innova Dev4VN","developerId":"7272793849788310748","priceText":"FREE","price":0,"free":true,"summary":"Fruits Juice is a sweet and interesting casual game.","scoreText":"0.0","score":0}]