[{"title":"Solitaire Classic Card","appId":"com.king2game.solitairequest","url":"https://play.google.com/store/apps/details?id=com.king2game.solitairequest","icon":"https://play-lh.googleusercontent.com/GQvYvGJm_x2AW94-Ia2626vHWOSIkdLOtFpW0LGYNrH4ZFBliRUy4OjUyiEBXbzasnE","developer":"CASUAL MINIGAMES","currency":"USD","price":0,"free":true,"summary":"Classic Solitaire Game - Free and more addictive than ever!<br><br>Popular and free Solitaire game worldwide. A great way to relax and kill time, play anytime, anywhere with patience and perseverance. Get ready to challenge your wits and exercise your patience by testing the classic Solitaire game for free! Solitaire card game will surely satisfy you.<br><br>The task in this Solitaire card game is to move all the cards from the four decks - checkered, cue, spade and spade - to the drawer. In total, the classic Solitaire game uses a deck of 52 cards.<br><br>You need to arrange the cards in order from Ace to K (A, 2, 3 and so on). You can also move cards between columns and arrange them in descending order, alternating black and red. For example, you can only place a black 10 on a red 9. And only the King can be placed on an empty square. The whole deck can be moved by dragging them to another column.<br><br>The game Solitaire, also known as Patience in Europe (like England, France, etc.), is a single-player card game.<br>Solitaire Game - a fun selection from the Classic Solitaire collection, along with Cube, Freecell, Spider, Tri Peaks, Pyramind, Golf, Mahjong and Yukon.<br><br>Salient features:<br>- Classic, fun and engaging gameplay of Solitaire<br>- Mode for left- or right-handed people, providing a convenient experience<br>- 3 Challenge Modes, create more opportunities to experience the game<br>- Detailed statistics, help you track and improve your skills<br>- Unlimited hints and the ability to undo, help you take the steps with confidence.","scoreText":"0.0","score":0},{"title":"Sniper Shooter","appId":"com.king.game247.snipershooter","url":"https://play.google.com/store/apps/details?id=com.king.game247.snipershooter","icon":"https://play-lh.googleusercontent.com/_arT6dwwrC3hWZywet2wHV5FVornHnJiKTWwADyahLllT4dZ44mVaqWVHgK17ee41Uc","developer":"CASUAL MINIGAMES","currency":"USD","price":0,"free":true,"summary":"&quot;Sniper Shooter&quot; is a thrilling dynamic shooting game where you will become a sniper master and experience bouncy action. With beautiful 3D graphics, this game promises to bring you a challenging experience.","scoreText":"0.0","score":0},{"title":"Cat and Dog","appId":"com.qqgame68.catanddog","url":"https://play.google.com/store/apps/details?id=com.qqgame68.catanddog","icon":"https://play-lh.googleusercontent.com/21Nw_eqjzN0z-YISPfmeqWfbrcnZKGuFwNJw-bbr3XRjq7C_zvgBN8GGN1RcYbzZnQ","developer":"CASUAL MINIGAMES","currency":"USD","price":0,"free":true,"summary":"You will play the role of a smart cat, must calculate the exact distance to throw objects at the dog. Each time you make a throw, you must estimate the distance and angle of the throw so that the object will hit the dog until you win.","scoreText":"0.0","score":0},{"title":"Shadow Assassin Hunter","appId":"com.hgame23.games.blademaster","url":"https://play.google.com/store/apps/details?id=com.hgame23.games.blademaster","icon":"https://play-lh.googleusercontent.com/sOGUVtmVKIEPIlZoWEWsx0uPJvehM01IGLogZYbxNqqNCrWeD40HuiI0akMyTW53uQ","developer":"CASUAL MINIGAMES","currency":"USD","price":0,"free":true,"summary":"&quot;Shadow Assassin Hunter&quot; is a fast interactive action game with a challenging element. In the game, players will play the role of a professional assassin, operating in different environmental conditions to destroy enemies. They need to use their good strategy and sharp ability to avoid the attention of the enemy, progress further through complex levels. Hunter Assassin offers a tense and challenging action experience that requires players to have quick reaction speed and strategic shaping to accomplish their goals.","scoreText":"0.0","score":0},{"title":"Basketball REAL","appId":"com.hgame23.games.basketballking","url":"https://play.google.com/store/apps/details?id=com.hgame23.games.basketballking","icon":"https://play-lh.googleusercontent.com/eGUhkwXsK1UZCWMpbvN2ApZInO4gjrzX8gmRZvnMxeNptA6qmxkMD2PFok5IzhGepQ","developer":"CASUAL MINIGAMES","currency":"USD","price":0,"free":true,"summary":"Basketball REAL gives you a realistic experience with immersive sound. Discover new players and beautiful football fields!<br><br>Basketball legends are yours to choose from. Play your way to the top and attract attention to create your legacy, your way.<br><br>Dunk and dribble your way to victory with real-time and casual basketball leagues and games. Head-to-head games and matches unlock many attractive rewards.<br><br>Download Basketball REAL Mobile and become a basketball master every day.","scoreText":"0.0","score":0},{"title":"8 Ball Pool Pro","appId":"com.hgame23.games.poll8ballpro","url":"https://play.google.com/store/apps/details?id=com.hgame23.games.poll8ballpro","icon":"https://play-lh.googleusercontent.com/20jOua_yXWL5lX-zY0zUpqG1yiUEJzmkhOlzvhBP92eQw1ohXzimD2EA2IJ2PmurrQ","developer":"CASUAL MINIGAMES","currency":"USD","price":0,"free":true,"summary":"The classic 8-ball Pool game offers a fresh and exciting, immersive experience in the world of billiards. Take on AI opponents and immerse yourself in a modern arcade style 2D billiards game with a global community of players.<br><br>Download now 🎱 8 Ball Pool Pro and start your 8 ball billiards confrontation!<br><br>HOW TO PLAY<br>Simply swipe the screen to aim the billiards, drag the power bar to serve, show off your skills and focus deeply on the game of billiards. You will become the future billiards master.<br><br>8 Ball Pool Pro is one of the fun and exciting sports games. Now you can perfect your billiards skills offline and take on virtual opponents.<br>Join the game of billiards to experience rewarding and exciting challenges. Try it now!","scoreText":"0.0","score":0},{"title":"Sweet World 3","appId":"com.hgame23.games.sweetworld","url":"https://play.google.com/store/apps/details?id=com.hgame23.games.sweetworld","icon":"https://play-lh.googleusercontent.com/B15b1ZIkj6oORkQP30fOKpAEXNNx36oX0xTIiMQqVuTC-TA4HYpm17fP89Dbl3uSvAs","developer":"CASUAL MINIGAMES","currency":"USD","price":0,"free":true,"summary":"Sweet and colorful cake, addictive 3 puzzle game.<br>A relaxing and easy game that everyone can enjoy sweet with colorful graphics.<br><br>Move and Match 3 or more candies and cakes of the same color to clear them. Try to connect multiple sweets to clear them all and experience the stunning effect.<br><br>Experience more than +100 different exciting missions and levels that you also want to own.<br><br>* Sweet World 3 Puzzle feature *<br>- Easy simple game rules and highly addictive fun gameplay<br>- No limit, play as much as possible!<br>- WIFI? Don&#39;t worry! Play anytime and anywhere without internet.<br>- Low-volume game files, downloadable on all devices.","scoreText":"0.0","score":0},{"title":"Magic Juice Shop","appId":"com.hgame23.games.magicjuiceshop","url":"https://play.google.com/store/apps/details?id=com.hgame23.games.magicjuiceshop","icon":"https://play-lh.googleusercontent.com/-c_NGsyNq-N7JMd6RTwYDHZaRgA1nR-zdWxbkfVHb6izxwJh_hyTVtgt1ltRmHI5XLE","developer":"CASUAL MINIGAMES","currency":"USD","price":0,"free":true,"summary":"Welcome to the world of juice shop simulation game!<br><br>This app gives you the opportunity to be the boss of your own juice and beverage chain and manage every aspect of that chain, from staff recruitment to store expansion. The goal of this game is to develop a juice shop to achieve the highest sales and national success!<br><br>When completing the game, you will have the opportunity to upgrade your limits and facilities, making store management more efficient. You will also be able to set up a chain of juice shops, spreading your brand. To do that, you&#39;ll have to work hard, keep your customers happy and make sure the juice bar runs smoothly.<br><br>⭐️ Game features ️<br>• Simple gameplay. Get started easily!<br>• Take orders and collect money at the counter.<br>• Develop HR skills by RENTING employees and UPGRADE their skills.<br>• Unlimited Scalability!<br><br>Fast-paced, simple controls, and endlessly scalable, it&#39;s the perfect app for anyone who loves simulation games and wants to experience the thrills of running a successful business.<br><br>Whether you are a seasoned entrepreneur or just starting out, this app is sure to give you plenty of challenge and fun! So if you are ready to start a business, download Magic Juice Shop today and start your journey to becoming a juice shop owner!","scoreText":"0.0","score":0},{"title":"Tien Len Mien Nam","appId":"com.hgame23.tienlenmn","url":"https://play.google.com/store/apps/details?id=com.hgame23.tienlenmn","icon":"https://play-lh.googleusercontent.com/Gdd_QQ-dSTM3aNM1MW9NZviebYTPTXeVPD3ljSKk1WKEdiBFBmvBgT2B8jiJwH6fWl4","developer":"CASUAL MINIGAMES","currency":"USD","price":0,"free":true,"summary":"The card game Tien Len uses a deck of 52 cards, which is dealt equally to each player 13 cards. The player&#39;s task is to play cards from his hand, and the first person to run out of cards wins.<br><br>Tien Len Mien Nam version offers an attractive and engaging gameplay style, combined with professional visuals and vivid sound. This is really a unique entertainment game, while helping to practice Tien Len playing skills.<br><br>★ PLAY MODES ★<br>- Tien Len Mien Nam<br>- Go Up Counting Leaves<br>- Daily attractive events<br><br>★ HIGHLIGHTS ★<br>- Tien Len Mien Nam is an offline version that does not require an Internet connection. Even without Wifi, you can still join the game.<br>- You can participate in gambling anytime, anywhere without Internet or 3G, even on the plane.<br>- The game is completely free, play fun entertainment.<br>- Professionally designed interface, with beautiful images and vivid sound.<br><br>★ NOTE ★<br>- Tien Len Mien Nam game is only for people over 12 years old.<br>- We are always improving the game quality to bring the best experience for players.<br>- Tien Len Mien Nam aims to provide a truly valuable entertainment experience for players.<br><br>Download now to experience the fun with the card game Tien Len Mien Nam!","scoreText":"0.0","score":0},{"title":"1 tỷ câu hỏi Ai là triệu phú","appId":"com.qhoang.ailatrieuphu","url":"https://play.google.com/store/apps/details?id=com.qhoang.ailatrieuphu","icon":"https://play-lh.googleusercontent.com/wexfEzujtgveHYad2poDrur9laJyfuga7mS8JOV_CgfWUD7D8VUhn2xnVk_9VRs-fBo","developer":"CASUAL MINIGAMES","currency":"USD","price":0,"free":true,"summary":"Ai là triệu phú là một game trí tuệ mô phỏng theo chương trình truyền hình trên kênh VTV3 cực kỳ thú vị trên Game vui. Khi tham gia Ai là triệu phú, người chơi sẽ có cơ hội trau dồi kiến thức trong rất nhiều lĩnh vực khác nhau của cuộc sống","scoreText":"0.0","score":0},{"title":"Xác nhận thanh toán tự động","appId":"com.qh.testpay","url":"https://play.google.com/store/apps/details?id=com.qh.testpay","icon":"https://play-lh.googleusercontent.com/EtAN4ONg2l_0r8RH0n0bOjq4f4tCB6-QtuR5JKXUI8pGO3N12WDHh5d7NShNB_25sR79","developer":"CASUAL MINIGAMES","developerId":"8501607524096940612","priceText":"$20.99","currency":"USD","price":20.99,"free":false,"summary":"Check &amp; activate orders automatically for MoMo, ViettelPay, VCB, MB..","scoreText":"0.0","score":0}]