[{"title":"Blumgi Slime","appId":"com.xgame247.blumgislime","url":"https://play.google.com/store/apps/details?id=com.xgame247.blumgislime","icon":"https://play-lh.googleusercontent.com/yEhf5A_s8Jz2RI4lg4P11oDs-Mz5gIi0KkaoO1Nv7wSgvBAneENZgWuA2aYZABLO8D4","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Blumgi Slime is an exciting arcade game designed to challenge your timing and aiming abilities as you navigate towards the finish line. Take charge of an adorable and bouncy character, whose movement is solely reliant on well-timed jumps.<br><br>*HOW TO PLAY:<br><br>Hold down the action button to channel your strength - the longer you hold it down, the higher and more intensely you will jump. Pass over various types of obstacles to touch the checkered platform. Each stage will introduce something fun and quirky in this game from new colors to obstacle types. You&#39;ll appreciate the perfect blend of challenge and colorful atmosphere when playing Blumgi Slime","scoreText":"0.0","score":0},{"title":"Fruit Juice Delights","appId":"com.xgame247.fruitjuice","url":"https://play.google.com/store/apps/details?id=com.xgame247.fruitjuice","icon":"https://play-lh.googleusercontent.com/cNche_xx7ftzXu6g2p7aKFl7eNbC7kV7PIflIT6cWKM49Z7N4pV3t1NEg8YqbWD3ft4","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Fruits Juice is a sweet and interesting casual game. Stop squeezing and start popping! Tap and pop 3 or more fruits. Enjoy sweet time in Fruits Juice with 460 completely new challenging levels!<br><br>Introducing FRUITS JUICE - a game you&#39;ll love!<br><br>🍓 160 fresh and exciting levels await you.<br>🗺️ Explore three amazing maps: Pitaya Loch, Peach Garden, Lemon Shoal.<br>🍩 Encounter interesting obstacles and collect delightful items like Cake, Bread, and Chocolate.<br>💥 Unlock an astonishing arsenal of boosters and props.<br>🍒 Enjoy the sweetness of cute and charming fruits.<br>🎮 Easy to pick up, but challenging to master.<br>🆓 Completely FREE to play!<br><br>How to Play:<br>👆 Tap on 2 or more adjacent fruits of the same kind to collect them.<br>🌟 Gather various fruits to conquer each level before running out of moves.<br>💫 Remember, the more fruits you collect in one go, the more stars you&#39;ll earn.<br><br>Stay tuned for upcoming incredible levels in the ever-growing world of Fruits Juice!","scoreText":"0.0","score":0},{"title":"Paws Rescue","appId":"com.xgame247.savethedog","url":"https://play.google.com/store/apps/details?id=com.xgame247.savethedog","icon":"https://play-lh.googleusercontent.com/zZhh0G9249JEeNv2biEdZiZNnRoFB8I9fKXdoyrSFL5RzNKxmNIrwTvmyN-n7Dbi4Q","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"An engaging and heartwarming game that invites players on a mission to save and protect adorable dogs in need. Prepare to embark on a thrilling adventure as you step into the shoes of a compassionate rescuer, dedicated to rescuing and caring for these furry companions. The aim of the game is to protect our cute dog from bee attacks. For this, you must create a defensive drawing","scoreText":"0.0","score":0},{"title":"Sweet World 3","appId":"com.dev4vn.games.sweetworld","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.sweetworld","icon":"https://play-lh.googleusercontent.com/FCOy1tHmOeIhiC6hZ_fSerkiLSNi3scwMzf_DvmYpVIHqmOxeW1twS_MJ7U5bfNtYSM","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Sweet World, a delightful matching game! Prepare yourself for an enchanting adventure set in a fantastical land of candy. Your objective is to uncover pairs of identical candies that can be linked using no more than three straight lines. As you connect these delightful tiles, new opportunities will arise, allowing you to progress and conquer each level. Get ready to encounter a multitude of thrilling and thought-provoking puzzles throughout Sweet World. Don&#39;t forget to share this captivating game with your friends and challenge them to beat your high scores!","scoreText":"0.0","score":0},{"title":"Neonlight","appId":"com.xgame247.neonlight","url":"https://play.google.com/store/apps/details?id=com.xgame247.neonlight","icon":"https://play-lh.googleusercontent.com/lJYcJ6kEtnSOD9ANVECPbVTmnhnJ4ZNy-vjCjjC3VOY47ydxTMb_a7tR8myAJ_9v6B-0","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Connect all the lamps to the main Battery. Click on a wire to rotate it.","scoreText":"0.0","score":0},{"title":"Flutter Cookbook","appId":"com.dev4vn.flutterbook","url":"https://play.google.com/store/apps/details?id=com.dev4vn.flutterbook","icon":"https://play-lh.googleusercontent.com/ruFbgglNVN5IhQYS9gvGi39_Qs4zmCc2t-XuiW8AXDWnk2Ws4OoQkd1av34DTuDhj30","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Flutter is a popular open-source mobile application development framework created by Google. It allows developers to build high-performance, visually appealing, and natively compiled applications for mobile, web, and desktop platforms using a single codebase.<br>This code snippet collection is designed to facilitate an easier understanding and learning of Flutter concepts.","scoreText":"0.0","score":0},{"title":"1020 Puzzle","appId":"com.xgame247.tentenblockpuzzle","url":"https://play.google.com/store/apps/details?id=com.xgame247.tentenblockpuzzle","icon":"https://play-lh.googleusercontent.com/dgQ_-pcmmFsqxdXeIcLQyXmee2WL_1HrfoGKkkKflcWciDpTJIfw4cM-mErv3gDjxQ","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Drag shapes on the board and complete rows or columns to score. Reach the goal to advance to the next level","scoreText":"0.0","score":0},{"title":"Toy Factory","appId":"com.xgame247.toyfactory","url":"https://play.google.com/store/apps/details?id=com.xgame247.toyfactory","icon":"https://play-lh.googleusercontent.com/LN8DPearkerq2GXCcJR-ki-aegFq5ntxPaKPPp8fa3ajJgpdqpzvhFSxxAwaNHFTTWM","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Toy factory is a beautiful toy game. Remove all blocks below the animals to finish a level. The game offers a vibrant and colorful world where players can explore different departments of the toy factory.","scoreText":"0.0","score":0},{"title":"Boxrob Evolution","appId":"com.xgame247.boxrob3","url":"https://play.google.com/store/apps/details?id=com.xgame247.boxrob3","icon":"https://play-lh.googleusercontent.com/j-lBOuw_197UmrToEWkhzaoDJdzJAjEORMujNE1qoxWqCIfd-cyHCvI1v9UVM6PhHR6D","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"An enhanced sequel to the popular puzzle platform game! Take control of a highly versatile forklift as you embark on a thrilling adventure of loading cargo onto trucks. With its improved flexibility and dynamic mechanics, BoxFlex offers a fresh and engaging experience.<br><br>Your objective in each level is to gather all the scattered boxes and skillfully deposit them into their designated slots. While some levels may present simple challenges, requiring you to navigate and collect boxes, the game progressively intensifies as you advance. Brace yourself for intricate puzzles that demand strategic thinking and precision.<br><br>Unlock a range of special moves and follow carefully crafted sequences to unravel the mysteries within each level. Use your wits to crack the codes, manipulate objects, and overcome obstacles, all while aiming to complete each stage. And don&#39;t forget to share the excitement of BoxFlex with your friends, challenging them to beat your high scores and embark on their own cargo-loading journeys.","scoreText":"0.0","score":0},{"title":"Mane Run","appId":"com.xgame247.manerun","url":"https://play.google.com/store/apps/details?id=com.xgame247.manerun","icon":"https://play-lh.googleusercontent.com/isKB6fAz_iWAEh-rTQDYgPMXA3khulTfJEmSPQjyQtLpLqD-ZhmtCZubVf4Rqt1hyY4","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Mane Run: The Dreadhead Chronicles is an exhilarating game that puts you in the shoes of the daring protagonist, Dreadhead. Embark on a thrilling journey through various levels, where you&#39;ll showcase your acrobatic skills by sliding, backflipping, frontflipping, and traversing obstacles to reach the ultimate goal. As you progress, be sure to grab all the coins scattered throughout the levels to unlock exciting new character skins and aim for high scores.","scoreText":"0.0","score":0},{"title":"ChatAIGPT","appId":"com.dev4vn.chatgpt","url":"https://play.google.com/store/apps/details?id=com.dev4vn.chatgpt","icon":"https://play-lh.googleusercontent.com/5f4r_syuxfh4HplvJCwY1QtRAmVMsHLsIcRup-8phAdX82doCutrGU3vQkYLxarOYbY","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"ChatAIGPT is a smart chat app for everyone. It is developed based on chatgpt&#39;s AI extension and has been upgraded. You can ask this chatbot any question and you will find the answer you want.","scoreText":"0.0","score":0},{"title":"Onet Garden","appId":"com.dev4vn.games.onetgarden","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.onetgarden","icon":"https://play-lh.googleusercontent.com/p5-H3D9TMYgJQ-AqaazqudaOYGVS9nO6Bj09P1uHqixXkx28kIwkzduMywIDqAttnGv9","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Onet Match is a captivating puzzle game where your task is to connect identical icons. Embark on an exciting journey through three distinct game modes. In &quot;Classic Mode,&quot; challenge yourself to conquer all levels as you strive for victory. &quot;Endless Mode&quot; will test your skill as you strive to complete as many levels as possible before running out of moves. Finally, in &quot;Time Rush Mode,&quot; put your speed and strategy to the test as you aim to finish as many levels as you can within 60 seconds, earning time bonuses for every successful match.","scoreText":"0.0","score":0},{"title":"Onet Puzzle","appId":"com.dev4vn.games.onetpuzzle","url":"https://play.google.com/store/apps/details?id=com.dev4vn.games.onetpuzzle","icon":"https://play-lh.googleusercontent.com/gOL9_9R7TWp9IMqqT-sJKb30_bVtRaQ887lwmbeHu2n_CEBmQD_kB6fVE7LaAsiW2ESz","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"the highly anticipated sequel to the beloved puzzle game, Onet Paradise. Embark on an exciting journey where your objective is to locate and connect pairs of identical tiles using three or fewer straight lines. As you connect the tiles, new possibilities unfold, providing you with fresh opportunities to clear each level. Prepare to challenge yourself and overcome a series of engaging new levels. Should you encounter a difficult puzzle, fear not! A helpful hint feature is conveniently located at the top of the page, ready to assist you in getting back on track. Get ready to dive into the captivating world of Onet Master and test your matching skills to the limit!","scoreText":"0.0","score":0},{"title":"Block Stacker","appId":"com.xgame247.stacktris","url":"https://play.google.com/store/apps/details?id=com.xgame247.stacktris","icon":"https://play-lh.googleusercontent.com/3vaXY2OIC4TYWG58vhwseY_bsvNld6PE-vz_CgdqVhcL7Lw_No6VzmPxdICNEzoZmEg","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"BlockStacker is an exciting arcade game that revolves around stacking and balancing blocks known as tetrominoes without causing them to topple over. It combines the enjoyable gameplay of Tetris with the challenging aspect of tower stacking games. BlockStacker will truly test your skills in maintaining balance. In the game, you are given a tetromino block that continuously spins at an increasing speed. To control it, tap on the block to halt its rotation and drag it to position it above the platform. Release your hold to drop the block into place. It&#39;s crucial to exercise precision in your movements because even if just one block falls off, you will lose the game. Get ready to demonstrate your balancing abilities in BlockStacker","scoreText":"0.0","score":0},{"title":"Asteroids 1979","appId":"com.xgame247.asteroids","url":"https://play.google.com/store/apps/details?id=com.xgame247.asteroids","icon":"https://play-lh.googleusercontent.com/jM9SCjcw70rIcIsNkb3TVWpn0-LCnZSNhPdKZFKtbEYG3v3wPxxurqcQ-Qh6aJq5Vg","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Asteroids is a classic arcade game that was first released in 1979. In this fast-paced space shooter, players control a small spaceship navigating through an asteroid field. The objective is to destroy the asteroids and other enemy spacecraft while avoiding collisions and incoming fire. The game features simple but addictive gameplay, with players relying on their reflexes and precision to shoot down the asteroids, which break into smaller pieces when hit.","scoreText":"0.0","score":0},{"title":"Ekg runner","appId":"com.xgame247.ekgrunner","url":"https://play.google.com/store/apps/details?id=com.xgame247.ekgrunner","icon":"https://play-lh.googleusercontent.com/g8caTt0O0SFoz-4WI2t2v5XX0_tfbyf9ntCp_YO36QKq_bmSw6PL9hIwRKq9jv-WJwOM","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"EKG Runner is an exhilarating endless runner game that combines fast-paced action with a unique medical theme. In this adrenaline-fueled adventure, players take on the role of a daring heart surgeon who must navigate through a maze of obstacles and challenges to save their patient&#39;s life.","scoreText":"0.0","score":0},{"title":"Digger 1984","appId":"com.xgame247.digger","url":"https://play.google.com/store/apps/details?id=com.xgame247.digger","icon":"https://play-lh.googleusercontent.com/sI_kpaaJWBJP604aV9_Ea4yhazLgWv6-lcUBXykcdaxUmh8tLiH_N8rwqAwyPAWKM6Y","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Digger is a classic arcade game that was released in the early 1980s. In the game, players control a character called &quot;Digger,&quot; who must dig tunnels through dirt-filled levels while avoiding enemies and collecting valuable items","scoreText":"0.0","score":0},{"title":"Space Retro Alien Invasion","appId":"com.xgame247.alieninvasion","url":"https://play.google.com/store/apps/details?id=com.xgame247.alieninvasion","icon":"https://play-lh.googleusercontent.com/mkK-hLhVVEUgZ2LFahOwiWluSnrr4J609XzwxSmxCXFxGa52QJ32bCvFwiht2GuN1wk","developer":"dev4vn","currency":"USD","price":0,"free":true,"summary":"Space Retro Alien Invasion is an action-packed, sci-fi game that takes players on a thrilling journey through the depths of space. In this classic-style shooter, players must battle waves of alien invaders and fend off their attacks using an arsenal of futuristic weapons and power-ups. With retro-inspired graphics and a nostalgic soundtrack, this game offers an immersive experience that harks back to the golden age of arcade gaming","scoreText":"0.0","score":0}]